Revit 2024 API
MacroManager.GetDocumentMacroSecurityOptions Method
 Gets the document macro security options.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static DocumentMacroOptions GetDocumentMacroSecurityOptions(
	Application application
)
Visual Basic
Public Shared Function GetDocumentMacroSecurityOptions ( _
	application As Application _
) As DocumentMacroOptions
Visual C++
public:
static DocumentMacroOptions GetDocumentMacroSecurityOptions(
	Application^ application
)
Parameters
application
Type: Autodesk.Revit.ApplicationServices.Application
 The application.
Return Value
 Returns the document macro security options.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace